import { FaVectorSquare, FaClock, FaWallet, FaCheck, FaLanguage } from 'react-icons/fa';

export const services = [
  { id: 1, title: 'لایسنس ویندوز ۱۱', price: '۹۰,۰۰۰', region: 'همه ریجن ها' },
  { id: 2, title: 'اکانت پرمیوم یوتیوب', price: '۱۰۰,۰۰۰', region: 'همه ریجن ها' },
  { id: 3, title: 'اکانت پرمیوم اسپاتیفای یک ماهه', price: '۲۰۰,۰۰۰', region: 'ریجن آمریکا' },
  { id: 4, title: 'اکانت پرمیوم تلگرام یک ساله', price: '۱۲۰,۰۰۰', region: 'همه ریجن ها' },
];

export const filters = [
  {
    id: 1,
    title: 'دسته بندی ها',
    subtitle: 'Categories',
    icon: <FaVectorSquare />,
    type: 'checkbox',
    options: [{ title: 'استریم فیلم و سریال' }, { title: 'استریم موزیک' }, { title: 'هوش مصنوعی' }],
  },
  {
    id: 2,
    title: 'مدت زمان اشتراک',
    subtitle: 'Time Duration',
    icon: <FaClock />,
    type: 'checkbox',
    options: [{ title: 'استریم فیلم و سریال' }, { title: 'استریم موزیک' }, { title: 'هوش مصنوعی' }],
  },
  { id: 3, title: 'محدوده قیمت', subtitle: 'Price', icon: <FaWallet />, type: 'slider' },
  {
    id: 4,
    title: 'نحوه فعال سازی',
    subtitle: 'Activation Method',
    icon: <FaCheck />,
    type: 'checkbox',
    options: [{ title: 'استریم فیلم و سریال' }, { title: 'استریم موزیک' }, { title: 'هوش مصنوعی' }],
  },
  {
    id: 5,
    title: 'زبان ها',
    subtitle: 'Language',
    icon: <FaLanguage />,
    type: 'checkbox',
    options: [{ title: 'استریم فیلم و سریال' }, { title: 'استریم موزیک' }, { title: 'هوش مصنوعی' }],
  },
];

export const plans = [
  { id: 1, title: 'یکماهه', price: 150_000 },
  { id: 2, title: 'سه ماهه', price: 250_000 },
  { id: 4, title: 'یکساله', price: 120_000 },
];

export const productPlans = [
  {
    id: 1,
    type: 'Premium Family',
    title: 'پرمیوم فمیلی',
    options: [
      {
        id: 1,
        title: 'تا ۶ حساب کاربری جداگانه',
        description:
          'این پلن به هر عضو خانواده یک حساب مستقل با پلی‌لیست‌ها و پیشنهادات شخصی اختصاص می‌دهد.',
      },
      {
        id: 2,
        title: 'بدون تبلیغات',
        description: 'تمام اعضا می‌توانند بدون مزاحمت تبلیغات، موسیقی گوش دهند.',
      },
      {
        id: 3,
        title: 'بدون تبلیغات',
        description: 'تمام اعضا می‌توانند بدون مزاحمت تبلیغات، موسیقی گوش دهند.',
      },
      {
        id: 4,
        title: 'کنترل والدین',
        description: ' قابلیت تنظیم و محدود کردن محتوای مناسب برای کودکان در دسترس است.',
      },
    ],
  },
  {
    id: 2,
    type: 'Premium Individual',
    title: 'پرمیوم تک کاربره',
    options: [
      {
        id: 1,
        title: 'بدون تبلیغات',
        description: 'تمام اعضا می‌توانند بدون مزاحمت تبلیغات، موسیقی گوش دهند.',
      },
      {
        id: 2,
        title: 'پخش آفلاین',
        description: 'قابلیت دانلود موسیقی و گوش دادن بدون نیاز به اینترنت در هرکجا که اراده کنید.',
      },
      {
        id: 3,
        title: 'کیفیت صدای بالاتر',
        description: 'دسترسی به بیش از ۱۰۰.۰۰۰.۰۰۰ موسیقی و پادکست با کیفیت صدای باورنکردنی.',
      },
      {
        id: 4,
        title: 'کنترل کامل موسیقی',
        description:
          'امکان انتخاب موسقی٬ بدون محدودیت در پرش (skip) آهنگ‌ها یا نیاز به حالت پخش تصادفی (Shuffle)',
      },
    ],
  },
  {
    id: 3,
    type: 'Premium Duo',
    title: 'پرمیوم دو کاربره',
    options: [
      {
        id: 1,
        title: 'دو حساب جداگانه',
        description: 'هر کاربر اکانت شخصی خود را با تنظیمات و پلی‌لیست‌های جداگانه دارد.',
      },
      {
        id: 2,
        title: 'ارزان‌تر از دو اشتراک تک‌کاربره',
        description: 'برای زوج‌ها یا دوستانی که باهم زندگی می‌کنند مقرون‌به‌صرفه‌تر است.',
      },
      {
        id: 3,
        title: 'پلی‌لیست Duo Mix',
        description: 'لیستی ترکیبی و خودکار از آهنگ‌های موردعلاقه هر دو کاربر پلن Duo است.',
      },
      {
        id: 4,
        title: 'بدون تبلیغات',
        description: 'تمام اعضا می‌توانند بدون مزاحمت تبلیغات، موسیقی گوش دهند.',
      },
    ],
  },
];

export const currentAccountActivationSteps = [
  {
    id: 1,
    title: 'انتخاب نوع اشتراک',
    description:
      'اشتراک دلخواه خود را (مثلاً فردی، دو نفره یا خانوادگی) از لیست محصولات سایت انتخاب کنید و روی گزینه “افزودن به سبد خرید” کلیک کنید.',
  },
  {
    id: 2,
    title: 'ثبت اطلاعات کاربری اسپاتیفای',
    description:
      'در فرم ارائه‌شده، ایمیل یا نام کاربری حساب اسپاتیفای خود را به همراه رمز اکانت خود وارد کنید. اطمینان حاصل کنید که اطلاعات واردشده صحیح باشد.',
  },
  {
    id: 3,
    title: 'تکمیل پرداخت',
    description:
      'روش پرداخت موردنظر خود را انتخاب کرده و هزینه اشتراک را از طریق درگاه پرداخت ایمن سایت واریز کنید.',
  },
  {
    id: 4,
    title: 'تأیید سفارش',
    description:
      'پس از تکمیل خرید، یک پیام یا ایمیل تأیید شامل جزئیات سفارش و وضعیت پردازش دریافت خواهید کرد.',
  },
  {
    id: 5,
    title: 'فعال‌سازی اشتراک',
    description:
      'در ادامه اکانتیتو اشتراک پرمیوم را با توجه به نوع اشتراک انتخاب شده توسط شما بر روی اکانت شما فعال میکند.',
  },
  {
    id: 6,
    title: 'استفاده از اشتراک پرمیوم',
    description:
      'پس از فعال شدن اشتراک پرمیوم اکانت پرو با ارسال یک ایمیل این موضوع را به شما اطلاع میدهد. اکنون میتوانید از موسیقی دلخواهتان لذت ببرید!',
  },
];

export const newAccountActivationSteps = [
  {
    id: 1,
    title: 'انتخاب نوع اشتراک',
    description:
      'اشتراک دلخواه خود را (مثلاً فردی، دو نفره یا خانوادگی) از لیست محصولات سایت انتخاب کنید و روی گزینه “افزودن به سبد خرید” کلیک کنید.',
  },
  {
    id: 2,
    title: 'تکمیل پرداخت',
    description:
      'روش پرداخت موردنظر خود را انتخاب کرده و هزینه اشتراک را از طریق درگاه پرداخت ایمن سایت واریز کنید.',
  },
  {
    id: 3,
    title: 'تأیید سفارش و دریافت اطلاعات اکانت',
    description:
      'پس از تکمیل خرید، یک پیام یا ایمیل تأیید شامل جزئیات سفارش و اطلاعات حساب کاربری جدید دریافت خواهید کرد. ',
  },
  {
    id: 4,
    title: 'استفاده از اشتراک پرمیوم',
    description:
      'حالا میتوانید وارد حساب کاربری خود شده و از گوش دادن به موسیقس موردعلاقه‌‌تان لذت ببرید!',
  },
];

export const productActivationImportantPoints = [
  {
    id: 1,
    title: 'اطمینان از انتخاب نوع اشتراک',
    description:
      'پیش از خرید، مطمئن شوید که نوع اشتراک (مثلاً خانوادگی، دانشجویی، یا فردی) با نیازهای شما مطابقت دارد.',
  },
  {
    id: 2,
    title: 'بررسی شرایط فعال‌سازی',
    description:
      'مطمئن شوید که اطلاعات حساب شما کامل و درست است تا اشتراک بدون مشکل روی اکانت شما فعال شود.',
  },
  {
    id: 3,
    title: 'تغییر رمز عبور بعد از فعال‌سازی',
    description:
      'برای حفظ امنیت اکانت، توصیه می‌شود بلافاصله پس از فعال‌سازی اشتراک، رمز عبور خود را تغییر دهید.',
  },
  {
    id: 4,
    title: 'بررسی سازگاری با دستگاه‌ها',
    description:
      'اطمینان حاصل کنید که دستگاه‌هایی که استفاده می‌کنید از اشتراک خریداری‌شده پشتیبانی می‌کنند.',
  },
  {
    id: 5,
    title: 'اطلاع از شرایط پشتیبانی',
    description:
      'در صورت بروز هرگونه مشکل در فرآیند فعال‌سازی یا استفاده، به پشتیبانی سایت مراجعه کنید.',
  },
  {
    id: 6,
    title: 'شرایط لغو اشتراک',
    description: 'شرایط لغو اشتراک را قبل از خرید بررسی کنید تا در آینده با مشکلی مواجه نشوید',
  },
];
